; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v2 ?v5)
             (pred_10 ?v8 ?v7)
             (pred_5 ?v2 ?v7)
             (pred_6 ?v13 ?v2 )
	     (pred_4 ?v2)
             (pred_7 ?v1)
             (pred_12 ?v8)
             (pred_9 ?v7)
             (pred_11 ?v2)
             (pred_3 ?v8)
             (pred_8 ?v2)
             (pred_1 ))



(:action op_2
:parameters (?v11 ?v3 ?v9 ?v10)
:precondition (and (pred_7 ?v11) (pred_7 ?v3) (pred_12 ?v9) (pred_9 ?v10)
          (pred_2 ?v11 ?v3) (pred_10 ?v9 ?v10)
                   (pred_5 ?v3 ?v10) (pred_4 ?v11) 
                   (pred_11 ?v3) (pred_3 ?v9))
:effect (and  (pred_8 ?v3) (not (pred_11 ?v3))))


(:action op_1
:parameters (?v11 ?v4)
:precondition (and (pred_7 ?v11) (pred_7 ?v4)
               (pred_4 ?v11) (pred_2 ?v11 ?v4) (pred_8 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v11))))

(:action op_5
:parameters (?v11 ?v9)
:precondition (and (pred_7 ?v11) (pred_12 ?v9) 
                  (pred_4 ?v11) (pred_6 ?v9 ?v11) (pred_1 ))
:effect (and (pred_3 ?v9)
   (not (pred_6 ?v9 ?v11)) (not (pred_1 ))))


(:action op_3
:parameters (?v11 ?v6 ?v12)
:precondition (and (pred_7 ?v11) (pred_12 ?v6) (pred_12 ?v12)
                  (pred_4 ?v11) (pred_3 ?v12) (pred_6 ?v6 ?v11))
:effect (and (pred_3 ?v6) (pred_6 ?v12 ?v11)
        (not (pred_3 ?v12)) (not (pred_6 ?v6 ?v11))))

(:action op_4
:parameters (?v11 ?v9)
:precondition (and (pred_7 ?v11) (pred_12 ?v9) 
                  (pred_4 ?v11) (pred_3 ?v9))
:effect (and (pred_1 ) (pred_6 ?v9 ?v11) (not (pred_3 ?v9)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_18 obj_02 obj_21 obj_10 obj_20 obj_14 obj_06 obj_17 obj_03 obj_07 obj_12 obj_13 obj_05 obj_08 obj_11
    obj_09 obj_19
    obj_16 obj_01 obj_04
    )

    (:init
       (pred_1)

       (pred_7 obj_15)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_21)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_14)
       (pred_7 obj_06)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_7 obj_12)
       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_04)

       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_02 obj_21)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_21 obj_06)
       (pred_2 obj_21 obj_02)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_10 obj_20)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_20 obj_03)
       (pred_2 obj_20 obj_14)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_10)
       (pred_2 obj_14 obj_07)
       (pred_2 obj_14 obj_06)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_20)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_06 obj_14)
       (pred_2 obj_17 obj_13)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_03 obj_05)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_20)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_07 obj_12)
       (pred_2 obj_07 obj_14)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_17)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_05 obj_03)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_5  obj_15 obj_09)
       (pred_5  obj_10 obj_19)
       (pred_5  obj_20 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_14)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_12)
       (pred_8 obj_13)
       (pred_8 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_11)

       (pred_10  obj_16 obj_09)
       (pred_10  obj_01 obj_19)
       (pred_10  obj_04 obj_19)
       (pred_6 obj_16 obj_21)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_04 obj_18)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_6 obj_16 obj_05)
       (pred_6 obj_04 obj_03)
    ))
(:constraints
  (always (not (pred_4 obj_20)))
)
)

; plan
1. (op_1 obj_03 obj_07)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_07)
   goals met: 0 of 2
2. (op_1 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 0 of 2
3. (op_1 obj_14 obj_02)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_02)
   goals met: 0 of 2
4. (op_1 obj_02 obj_21)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_21)
   goals met: 0 of 2
5. (op_5 obj_21 obj_16)
   deleted: (pred_6 obj_16 obj_21) (pred_1)
   added: (pred_3 obj_16)
   goals met: 0 of 2
6. (op_1 obj_21 obj_02)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_02)
   goals met: 0 of 2
7. (op_4 obj_02 obj_16)
   deleted: (pred_3 obj_16)
   added: (pred_1) (pred_6 obj_16 obj_02)
   goals met: 0 of 2
8. (op_1 obj_02 obj_18)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_18)
   goals met: 0 of 2
9. (op_5 obj_18 obj_04)
   deleted: (pred_6 obj_04 obj_18) (pred_1)
   added: (pred_3 obj_04)
   goals met: 0 of 2
10. (op_1 obj_18 obj_02)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_02)
   goals met: 0 of 2
11. (op_1 obj_02 obj_14)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_14)
   goals met: 0 of 2
12. (op_4 obj_14 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_1) (pred_6 obj_04 obj_14)
   goals met: 0 of 2
13. (op_1 obj_14 obj_02)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_02)
   goals met: 0 of 2
14. (op_5 obj_02 obj_16)
   deleted: (pred_6 obj_16 obj_02) (pred_1)
   added: (pred_3 obj_16)
   goals met: 0 of 2
15. (op_1 obj_02 obj_14)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_14)
   goals met: 0 of 2
16. (op_1 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 0 of 2
17. (op_4 obj_07 obj_16)
   deleted: (pred_3 obj_16)
   added: (pred_1) (pred_6 obj_16 obj_07)
   goals met: 0 of 2
18. (op_1 obj_07 obj_14)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_14)
   goals met: 0 of 2
19. (op_5 obj_14 obj_04)
   deleted: (pred_6 obj_04 obj_14) (pred_1)
   added: (pred_3 obj_04)
   goals met: 0 of 2
20. (op_1 obj_14 obj_07)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_07)
   goals met: 0 of 2
21. (op_1 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_03)
   goals met: 0 of 2
22. (op_4 obj_03 obj_04)
   deleted: (pred_3 obj_04)
   added: (pred_1) (pred_6 obj_04 obj_03)
   goals met: 1 of 2
23. (op_1 obj_03 obj_07)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_07)
   goals met: 1 of 2
24. (op_5 obj_07 obj_16)
   deleted: (pred_6 obj_16 obj_07) (pred_1)
   added: (pred_3 obj_16)
   goals met: 1 of 2
25. (op_1 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_03)
   goals met: 1 of 2
26. (op_1 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 1 of 2
27. (op_4 obj_05 obj_16)
   deleted: (pred_3 obj_16)
   added: (pred_1) (pred_6 obj_16 obj_05)
   goals met: 2 of 2
